{"class_name": "Model", "config": {"name": "model_16", "layers": [{"name": "input_16", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "name": "input_16"}, "inbound_nodes": []}, {"name": "flatten_16", "class_name": "Flatten", "config": {"name": "flatten_16", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["input_16", 0, 0, {}]]]}, {"name": "dense_46", "class_name": "Dense", "config": {"name": "dense_46", "trainable": true, "units": 250, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_16", 0, 0, {}]]]}, {"name": "dense_47", "class_name": "Dense", "config": {"name": "dense_47", "trainable": true, "units": 230, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_46", 0, 0, {}]]]}, {"name": "dense_48", "class_name": "Dense", "config": {"name": "dense_48", "trainable": true, "units": 200, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_47", 0, 0, {}]]]}, {"name": "dense_49", "class_name": "Dense", "config": {"name": "dense_49", "trainable": true, "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_48", 0, 0, {}]]]}], "input_layers": [["input_16", 0, 0]], "output_layers": [["dense_49", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}